OpenNuvoton/ISPTool/Firmwares/NUC200_220BSP/Library/Device/Nuvoton/NUC200Series/Include/NUC200Series.h
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ADC4 function is selected.
 * |        |          |(1, 1) = SC1_PWR function is selected.
 * |[5]     |GPA_MFP5  |PA.5 Pin Function Selection    
 * |        |          |Bits PA5_SC1RST (ALT_MFP1[8]) and GPA_MFP[5] determine the PA.5 function.
 * |        |          |(PA5_SC1RST, GPA_MFP5) value and function mapping is as following list,
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ADC5 function is selected.
 * |        |          |(1, 1) = SC1_RST function is selected.    
 * |[6]     |GPA_MFP6  |PA.6 Pin Function Selection
 * |        |          |Bits PA6_SC1CLK (ALT_MFP1[5]) and GPA_MFP[6] determine the PA.6 function.
 * |        |          |(PA6_SC1CLK, GPA_MFP6) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ADC6 function is selected.
 * |        |          |(1, 1) = SC1_CLK function is selected.   
 * |[7]     |GPA_MFP7  |PA.7 Pin Function Selection
 * |        |          |Bits PA7_SC1DAT (ALT_MFP1[6]), PA7_S21 (ALT_MFP[2]) and GPA_MFP[7] determine the PA.7 function.
 * |        |          |(PA7_SC1DAT, PA7_S21, GPA_MFP7) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = ADC7 function is selected.
 * |        |          |(0, 1, 1) = SPI2_SS1 function is selected.
 * |        |          |(1, 0, 1) = SC1_DAT function is selected. 
 * |[8]     |GPA_MFP8  |PA.8 Pin Function Selection
 * |        |          |Bit GPA_MFP[8] determines the PA.8 function.
 * |        |          |0 = GPIO function is selected to the pin PA.8.
 * |        |          |1 = I2C0_SDA function is selected to the pin PA.8.
 * |[10]    |GPA_MFP9  |PA.9 Pin Function Selection
 * |        |          |Bit GPA_MFP[9] determines the PA.9 function.
 * |        |          |0 = GPIO function is selected to the pin PA.9.
 * |        |          |1 = I2C0_SCL function is selected to the pin PA.9.
 * |[10]    |GPA_MFP10 |PA.10 Pin Function Selection
 * |        |          |Bit GPA_MFP[10] determine the PA.10 function.
 * |        |          |0 = GPIO function is selected to the pin PA.10.
 * |        |          |1 = I2C1_SDA function is selected to the pin PA.10.  
 * |[11]    |GPA_MFP11 |PA.11 Pin Function Selection
 * |        |          |Bit GPA_MFP[11] determine the PA.11 function.
 * |        |          |0 = GPIO function is selected to the pin PA.11.
 * |        |          |1 = I2C1_SCL function is selected to the pin PA.11. 
 * |[12]    |GPA_MFP12 |PA.12 Pin Function Selection
 * |        |          |Bits PA12_SC2DAT (ALT_MFP1[11]) and GPA_MFP[12] determine the PA.12 function.
 * |        |          |(PA12_SC2DAT, GPA_MFP12) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = PWM0 function is selected.
 * |        |          |(1, 1) = SC2_DAT function is selected.  
 * |[13]    |GPA_MFP13 |PA.13 Pin Function Selection     
 * |        |          |Bits PA13_SC2CLK (ALT_MFP1[10]) and GPA_MFP[13] determine the PA.13 function.
 * |        |          |(PA13_SC2CLK, GPA_MFP13) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = PWM1 function is selected.
 * |        |          |(1, 1) = SC2_CLK function is selected.     
 * |[14]    |GPA_MFP14 |PA.14 Pin Function Selection
 * |        |          |Bits PA14_SC2RST (ALT_MFP1[13]) and GPA_MFP[14] determine the PA.14 function.
 * |        |          |(PA14_SC2RST, GPA_MFP14) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = PWM2 function is selected.
 * |        |          |(1, 1) = SC2_RST function is selected.       
 * |[15]    |GPA_MFP15 |PA.15 Pin Function Selection     
 * |        |          |Bits PA15_SC2PWR (ALT_MFP1[12]), PA15_I2SMCLK (ALT_MFP[9]) and GPA_MFP[15] determine the PA.15 function.
 * |        |          |(PA15_SC2PWR, PA15_I2SMCLK, GPA_MFP15) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = PWM3 function is selected.
 * |        |          |(0, 1, 1) = I2S_MCLK function is selected.
 * |        |          |(1, 0, 1) = SC2_PWR function is selected.         
 * |[16:31] |GPA_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOA[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOA[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPB_MFP
 * Offset: 0x34  GPIOB Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPB_MFP0  |PB.0 Pin Function Selection     
 * |        |          |Bit GPB_MFP[0] determines the PB.0 function.
 * |        |          |0 = GPIO function is selected to the pin PB.0.
 * |        |          |1 = UART0_RXD function is selected to the pin PB.0.       
 * |[1]     |GPB_MFP1  |PB.1 Pin Function Selection
 * |        |          |Bit GPB_MFP[1] determines the PB.1 function.
 * |        |          |0 = GPIO function is selected to the pin PB.1.
 * |        |          |1 = UART0_TXD function is selected to the pin PB.1.     
 * |[2]     |GPB_MFP2  |PB.2 Pin Function Selection
 * |        |          |Bits PB2_CPO0 (ALT_MFP[30]), PB2_T2EX (ALT_MFP[26]) and GPB_MFP[2] determine the PB.2 function.
 * |        |          |(PB2_CPO0, PB2_T2EX, GPB_MFP2) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = UART0_nRTS function is selected.
 * |        |          |(0, 1, 1) = TM2_EXT function is selected.
 * |        |          |(1, 0, 1) = ACMP0_O function is selected.     
 * |[3]     |GPB_MFP3  |PB.3 Pin Function Selection
 * |        |          |Bits PB3_SC2CD (ALT_MFP1[14]), PB3_T3EX (ALT_MFP[27]) and GPB_MFP[3] determine the PB.3 function.
 * |        |          |(PB3_SC2CD, PB3_T3EX, GPB_MFP3) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = UART0_nCTS function is selected.
 * |        |          |(0, 1, 1) = TM3_EXT function is selected.
 * |        |          |(1, 0, 1) = SC2_CD function is selected.             
 * |[4]     |GPB_MFP4  |PB.4 Pin Function Selection
 * |        |          |Bit GPB_MFP[4] determines the PB.4 function.
 * |        |          |0 = GPIO function is selected to the pin PB.4.
 * |        |          |1 = UART1_RXD function is selected to the pin PB.4.     
 * |[5]     |GPB_MFP5  |PB 5 Pin Function Selection
 * |        |          |Bit GPB_MFP[5] determines the PB.5 function.
 * |        |          |0 = GPIO function is selected to the pin PB.5.
 * |        |          |1 = UART1_TXD function is selected to the pin PB.5.     
 * |[6]     |GPB_MFP6  |PB.6 Pin Function Selection 
 * |        |          |Bit GPB_MFP[6] determines the PB.6 function.
 * |        |          |0 = GPIO function is selected to the pin PB.6.
 * |        |          |1 = UART1_nRTS function is selected to the pin PB.6.
 * |[7]     |GPB_MFP7  |PB.7 Pin Function Selection
 * |        |          |Bit GPB_MFP[7] determines the PB.7 function.
 * |        |          |0 = GPIO function is selected to the pin PB.7.
 * |        |          |1 = UART1_nCTS function is selected to the pin PB.7.        
 * |[8]     |GPB_MFP8  |PB.8 Pin Function Selection
 * |        |          |Bits PB8_CLKO (ALT_MFP[29]) and GPB_MFP[8] determine the PB.8 function.
 * |        |          |(PB8_CLKO, GPB_MFP8) value and function mapping is as following list. 
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM0 function is selected.
 * |        |          |(1, 1) = CLKO function is selected.           
 * |[9]     |GPB_MFP9  |PB.9 Pin Function Selection
 * |        |          |Bits PB9_S11 (ALT_MFP[1]) and GPB_MFP[9] determine the PB.9 function.
 * |        |          |(PB9_S11, GPB_MFP9) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM1 function is selected.
 * |        |          |(1, 1) = SPI1_SS1 function is selected.         
 * |[10]    |GPB_MFP10 |PB.10 Pin Function Selection
 * |        |          |Bits PB10_S01 (ALT_MFP[0]) and GPB_MFP[10] determine the PB.10 function.
 * |        |          |(PB10_S01, GPB_MFP10) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM2 function is selected.
 * |        |          |(1, 1) = SPI0_SS1 function is selected.     
 * |[11]    |GPB_MFP11 |PB.11 Pin Function Selection
 * |        |          |Bits PB11_PWM4 (ALT_MFP[4]) and GPB_MFP[11] determine the PB.11 function.
 * |        |          |(PB11_PWM4, GPB_MFP11) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM3 function is selected.     
 * |        |          |(1, 1) = PWM4 function is selected. 
 * |[13]    |GPB_MFP13 |PB.13 Pin Function Selection
 * |        |          |Bit GPB_MFP[13] determines the PB.13 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = ACMP1_O function is selected.   
 * |[14]    |GPB_MFP14 |PB.14 Pin Function Selection
 * |        |          |Bits PB14_S31 (ALT_MFP[3]) and GPB_MFP[14] determine the PB.14 function.
 * |        |          |(PB14_S31, GPB_MFP14) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = INT0 function is selected.
 * |        |          |(1, 1) = SPI3_SS1 function is selected.
 * |[15]    |GPB_MFP15 |PB.15 Pin Function Selection
 * |        |          |Bits PB15_T0EX (ALT_MFP[24]) and GPB_MFP[15] determine the PB.15 function.
 * |        |          |(PB15_T0EX, GPB_MFP15) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = INT1 function is selected.
 * |        |          |(1, 1) = TM0_EXT function is selected.  
 * |[16:31] |GPB_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOB[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOB[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPC_MFP
 * Offset: 0x38  GPIOC Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPC_MFP0  |PC.0 Pin Function Selection
 * |        |          |Bits PC0_I2SLRCLK (ALT_MFP[5]) and GPC_MFP[0] determine the PC.0 function.
 * |        |          |(PC0_I2SLRCLK, GPC_MFP0) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_SS0 function is selected.
 * |        |          |(1, 1) = I2S_LRCLK function is selected.          
 * |[1]     |GPC_MFP1  |PC.1 Pin Function Selection
 * |        |          |Bits PC1_I2SBCLK (ALT_MFP[6]) and GPC_MFP[1] determine the PC.1 function.
 * |        |          |(PC1_I2SBCLK, GPC_MFP1) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_CLK function is selected.
 * |        |          |(1, 1) = I2S_BCLK function is selected.     
 * |[2]     |GPC_MFP2  |PC.2 Pin Function Selection
 * |        |          |Bits PC2_I2SDI (ALT_MFP[7]) and GPC_MFP[2] determine the PC.2 function.
 * |        |          |(PC2_I2SDI, GPC_MFP2) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO0 function is selected.
 * |        |          |(1, 1) = I2S_DI function is selected.
 * |[3]     |GPC_MFP3  |PC.3 Pin Function Selection
 * |        |          |Bits PC3_I2SDO (ALT_MFP[8]) and GPC_MFP[3] determine the PC.3 function.
 * |        |          |(PC3_I2SDO, GPC_MFP3) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI0 function is selected.
 * |        |          |(1, 1) = I2S_DO function is selected.     
 * |[4]     |GPC_MFP4  |PC.4 Pin Function Selection
 * |        |          |Bit GPC_MFP[9] determines the PC.4 function.
 * |        |          |0 = GPIO function is selected to the pin PC.4.
 * |        |          |1 = SPI0_MISO1 function is selected to the pin PC.4.     
 * |[5]     |GPC_MFP5  |PC.5 Pin Function Selection
 * |        |          |Bit GPC_MFP[5] determines the PC.5 function.
 * |        |          |0 = GPIO function is selected to the pin PC.5.
 * |        |          |1 = SPI0_MOSI1 function is selected to the pin PC.5.     
 * |[6]     |GPC_MFP6  |PC.6 Pin Function Selection
 * |        |          |Bits PC6_SC0CD (ALT_MFP1[4]) and GPC_MFP[6] determine the PC.6 function.
 * |        |          |(PC6_SC0CD, GPC_MFP6) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ACMP0_P function is selected.
 * |        |          |(1, 1) = SC0_CD function is selected.    
 * |[7]     |GPC_MFP7  |PC.7 Pin Function Selection
 * |        |          |Bits PC7_SC1CD (ALT_MFP1[9]) and GPC_MFP[7] determine the PC.7 function.
 * |        |          |(PC7_SC1CD, GPC_MFP7) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ACMP0_N function is selected.
 * |        |          |(1, 1) = SC1_CD function is selected.     
 * |[8]     |GPC_MFP8  |PC.8 Pin Function Selection
 * |        |          |Bit GPC_MFP[8] determines the PC.8 function.
 * |        |          |0 = GPIO function is selected to the pin PC.8.
 * |        |          |1 = SPI1_SS0 function is selected to the pin PC.8.    
 * |[9]     |GPC_MFP9  |PC.9 Pin Function Selection
 * |        |          |Bit GPC_MFP[9] determines the PC.9 function.
 * |        |          |0 = GPIO function is selected to the pin PC.9.
 * |        |          |1 = SPI1_CLK function is selected to the pin PC.9.          
 * |[10]    |GPC_MFP10 |PC.10 Pin Function Selection
 * |        |          |Bit GPC_MFP[10] determines the PC.10 function.
 * |        |          |0 = GPIO function is selected to the pin PC.10.
 * |        |          |1 = SPI1_MISO0 function is selected to the pin PC.10.    
 * |[11]    |GPC_MFP11 |PC.11 Pin Function Selection
 * |        |          |Bit GPC_MFP[11] determines the PC.11 function.
 * |        |          |0 = GPIO function is selected to the pin PC.11.
 * |        |          |1 = SPI1_MOSI0 function is selected to the pin PC.11.        
 * |[12]    |GPC_MFP12 |PC.12 Pin Function Selection
 * |        |          |Bit GPC_MFP[12] determines the PC.12 function.
 * |        |          |0 = GPIO function is selected to the pin PC.12.
 * |        |          |1 = SPI1_MISO1 function is selected to the pin PC.12.      
 * |[13]    |GPC_MFP13 |PC.13 Pin Function Selection
 * |        |          |Bit GPC_MFP[13] determines the PC.13 function.
 * |        |          |0 = GPIO function is selected to the pin PC.13.
 * |        |          |1 = SPI1_MOSI1 function is selected to the pin PC.13.     
 * |[14]    |GPC_MFP14 |PC.14 Pin Function Selection
 * |        |          |Bit GPC_MFP[14] determines the PC.14 function.
 * |        |          |0 = GPIO function is selected to the pin PC.14.
 * |        |          |1 = ACMP1_P function is selected to the pin PC.14.      
 * |[15]    |GPC_MFP15 |PC.15 Pin Function Selection
 * |        |          |Bit GPC_MFP[15] determines the PC.15 function.
 * |        |          |0 = GPIO function is selected to the pin PC.15.
 * |        |          |1 = ACMP1_N function is selected to the pin PC.15.      
 * |[16:31] |GPC_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOC[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOC[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPD_MFP
 * Offset: 0x3C  GPIOD Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPD_MFP0  |PD.0 Pin Function Selection
 * |        |          |Bit GPD_MFP[0] determines the PD.0 function.
 * |        |          |0 = GPIO function is selected to the pin PD.0.
 * |        |          |1 = SPI2_SS0 function is selected to the pin PD.0.     
 * |[1]     |GPD_MFP1  |PD.1 Pin Function Selection
 * |        |          |Bit GPD_MFP[1] determines the PD.1 function.
 * |        |          |0 = GPIO function is selected to the pin PD.1.
 * |        |          |1 = SPI2_CLK function is selected to the pin PD.1.
 * |[2]     |GPD_MFP2  |PD.2 Pin Function Selection
 * |        |          |Bit GPD_MFP[2] determines the PD.2 function.
 * |        |          |0 = GPIO function is selected to the pin PD.2.
 * |        |          |1 = SPI2_MISO0 function is selected to the pin PD.2.     
 * |[3]     |GPD_MFP3  |PD.3 Pin Function Selection
 * |        |          |Bit GPD_MFP[3] determines the PD.3 function.
 * |        |          |0 = GPIO function is selected to the pin PD.3.
 * |        |          |1 = SPI2_MOSI0 function is selected to the pin PD.3.     
 * |[4]     |GPD_MFP4  |PD.4 Pin Function Selection
 * |        |          |Bit GPD_MFP[4] determines the PD.4 function.
 * |        |          |0 = GPIO function is selected to the pin PD.4.
 * |        |          |1 = SPI2_MISO1 function is selected to the pin PD.4.     
 * |[5]     |GPD_MFP5  |PD.5 Pin Function Selection
 * |        |          |Bit GPD_MFP[9] determines the PD.5 function.
 * |        |          |0 = GPIO function is selected to the pin PD.5.
 * |        |          |1 = SPI2_MOSI1 function is selected to the pin PD.5.      
 * |[8]     |GPD_MFP8  |PD.8 Pin Function Selection
 * |        |          |Bit GPD_MFP[8] determines the PD.8 function.
 * |        |          |0 = GPIO function is selected to the pin PD.8.
 * |        |          |1 = SPI3_SS0 function is selected to the pin PD.8.     
 * |[9]     |GPD_MFP9  |PD.9 Pin Function Selection
 * |        |          |Bit GPD_MFP[9] determines the PD.9 function.
 * |        |          |0 = GPIO is function is selected to the pin PD.9.
 * |        |          |1 = SPI3_CLK function is selected to the pin PD.9.     
 * |[10]    |GPD_MFP10 |PD.10 Pin Function Selection
 * |        |          |Bit GPD_MFP[10] determines the PD.10 function.
 * |        |          |0 = GPIO function is selected to the pin PD.10.
 * |        |          |1 = SPI3_MISO0 function is selected to the pin PD.10.     
 * |[11]    |GPD_MFP11 |PD.11 Pin Function Selection
 * |        |          |Bit GPD_MFP[11] determines the PD.11 function.
 * |        |          |0 = GPIO function is selected to the pin PD.11.
 * |        |          |1 = SPI3_MOSI0 function is selected to the pin PD.11.     
 * |[12]    |GPD_MFP12 |PD.12 Pin Function Selection
 * |        |          |Bit GPD_MFP[12] determines the PD.12 function.
 * |        |          |0 = GPIO function is selected to the pin PD.12.
 * |        |          |1 = SPI3_MISO1 function is selected to the pin PD.12.     
 * |[13]    |GPD_MFP13 |PD.13 Pin Function Selection
 * |        |          |Bit GPD_MFP[13] determines the PD.13 function.
 * |        |          |0 = GPIO function is selected to the pin PD.13.
 * |        |          |1 = SPI3_MOSI1 function is selected to the pin PD.13.     
 * |[14]    |GPD_MFP14 |PD.14 Pin Function Selection
 * |        |          |Bit GPD_MFP[14] determines the PD.14 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = UART2_RXD function is selected.  
 * |[15]    |GPD_MFP15 |PD.15 Pin Function Selection
 * |        |          |Bit GPD_MFP[15] determines the PD.15 function.
 * |        |          |0 = GPIO function is selected.
 * |        |          |1 = UART2_TXD function is selected.  
 * |[16:31] |GPD_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOD[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOD[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPE_MFP
 * Offset: 0x40  GPIOE Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPE_MFP0  |PE.0 Pin Function Selection
 * |        |          |Bit GPE_MFP[0] determines the PE.0 function.
 * |        |          |0 = GPIO function is selected to the pin PE.0.
 * |        |          |1 = PWM6 function is selected to the pin PE.0.     
 * |[1]     |GPE_MFP1  |PE.1 Pin Function Selection
 * |        |          |Bit GPE_MFP[1] determines the PE.1 function.
 * |        |          |0 = GPIO function is selected to the pin PE.1.
 * |        |          |1 = PWM7 function is selected to the pin PE.1.     
 * |[5]     |GPE_MFP5  |PE.5 Pin Function Selection
 * |        |          |Bits PE5_T1EX (ALT_MFP[25]) and GPE_MFP5 determine the PE.5 function.
 * |        |          |(PE5_T1EX, GPE_MFP5) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = PWM5 function is selected.
 * |        |          |(1, 1) = TM1_EXT function is selected.  
 * |[16:31] |GPE_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOD[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOD[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPF_MFP
 * Offset: 0x44  GPIOF Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPF_MFP0  |PF.0 Pin Function Selection
 * |        |          |Bit GPF_MFP[0] determines the PF.0 function
 * |        |          |0 = GPIO function is selected to the pin PF.0.
 * |        |          |1 = XT1_OUT function is selected to the pin PF.0.
 * |        |          |Note: This bit is read only and is decided by user configuration CGPFMFP (Config0[27]).     
 * |[1]     |GPF_MFP1  |PF.1 Pin Function Selection
 * |        |          |Bit GPF_MFP[1] determines the PF.1 function.
 * |        |          |0 = GPIO function is selected to the pin PF.1.
 * |        |          |1 = XT1_IN function is selected to the pin PF.1.
 * |        |          |Note: This bit is read only and is decided by user configuration CGPFMFP (Config0[27]).     
 * |[2]     |GPF_MFP2  |PF.2 Pin Function Selection
 * |        |          |Bit GPF_MFP[2] determines the PF.2 function.
 * |        |          |0 = GPIO function is selected to the pin PF.2.
 * |        |          |1 = PS2_DAT function is selected to the pin PF.2.     
 * |[3]     |GPF_MFP3  |PF.3 Pin Function Selection
 * |        |          |Bit GPF_MFP[3] determines the PF.3 function.
 * |        |          |0 = GPIO function is selected to the pin PF.3.
